# This file includes:
# All brew install formulae you have installed
# All brew install --cask apps you installed

# Restore with:
# brew bundle --file=~/code/dotfiles/Brewfile

# When you install a new package, update Brewfile with:
# brew bundle dump --file=./Brewfile --force --describe

tap "dart-lang/dart"
tap "heroku/brew"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "sass/sass"
# Zstandard is a real-time compression algorithm
brew "zstd"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Core application library for C
brew "glib"
# GitHub command-line tool
brew "gh"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open h.265 video codec implementation
brew "libde265"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# H.265/HEVC encoder
brew "x265"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Network authentication protocol
brew "krb5"
# Postgres C API library
brew "libpq"
# C implementation of a Sass compiler
brew "libsass"
# YAML Parser
brew "libyaml"
# Next-gen compiler infrastructure
brew "llvm"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Object-relational database system
brew "postgresql@14", restart_service: :changed
# Object-relational database system
brew "postgresql@15", restart_service: :changed
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Cross-shell prompt for astronauts
brew "starship"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Image processing library
brew "vips"
# Internet file retriever
brew "wget"
# Library to create, extract, and modify Windows Imaging files
brew "wimlib"
# JavaScript package manager
brew "yarn"
# Everything you need to get started with Heroku
brew "heroku/brew/heroku"
# Stylesheet Preprocessor
brew "sass/sass/sass"
cask "font-source-code-pro-for-powerline"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Quick Look generator for Markdown files
cask "qlmarkdown"
vscode "akil-s.tokyo-dark"
vscode "alexcvzz.vscode-sqlite"
vscode "anteprimorac.html-end-tag-labels"
vscode "beardedbear.beardedtheme"
vscode "bradlc.vscode-tailwindcss"
vscode "christian-kohler.path-intellisense"
vscode "csstools.postcss"
vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "emmanuelbeziat.vscode-great-icons"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "fisheva.eva-theme"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "huytd.nord-light"
vscode "ionutvmi.path-autocomplete"
vscode "kamikillerto.vscode-colorize"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "misbahansori.svg-fold"
vscode "ms-vscode.sublime-keybindings"
vscode "naumovs.color-highlight"
vscode "oderwat.indent-rainbow"
vscode "phoenisx.cssvar"
vscode "ritwickdey.liveserver"
vscode "rubymaniac.vscode-paste-and-indent"
vscode "setobiralo.erb-commenter"
vscode "shopify.ruby-lsp"
vscode "sissel.shopify-liquid"
vscode "syler.sass-indented"
vscode "usernamehw.errorlens"
vscode "viktorqvarfordt.vscode-pitch-black-theme"
vscode "vincaslt.highlight-matching-tag"
vscode "vue.volar"
vscode "zneuray.erb-vscode-snippets"
